Tekla Open API Reference for Tekla Structures 2025
SectionMarkAttributes Constructor
Overload List
Name | Description
SectionMarkBase.SectionMarkAttributes()
 Creates a new default SectionMarkAttributes instance that loads standard attributes.
SectionMarkBase.SectionMarkAttributes(String)
 Creates a new SectionMarkAttributes instance that loads the specified attributes.
Top
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace